//VOLSPACE JOB (TEST),'TK5001 SPACE',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1)
//STEP1    EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=A
//DD1      DD UNIT=3390,VOL=SER=TSO001,DISP=OLD
//SYSIN    DD *
 LISTVTOC VOL=3390=TK5001,FORMAT
/*