//INITSEQ JOB (TEST),'INIT MONIBANK SEQ',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//MAKE     EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
ACCOUNT     000000000001
CARD        000000000001
CUSTOMER    000000000001
TRANSACTION 000000000001
/*
//SYSUT2   DD DSN=&&SEQIN,
//             DISP=(NEW,PASS,DELETE),
//             UNIT=SYSDA,
//             SPACE=(TRK,(1,1)),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=32,BLKSIZE=320)
//SYSIN    DD *
  GENERATE MAXFLDS=1
  RECORD FIELD=(32,1,,1)
/*
//LOAD     EXEC PGM=IDCAMS,COND=(0,NE,MAKE)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//INDD     DD DSN=&&SEQIN,DISP=(OLD,DELETE)
//OUTDD    DD DSN=MBANK.SEQ,DISP=SHR
//SYSIN    DD *
  REPRO INFILE(INDD) OUTFILE(OUTDD)
/*
//CHECK    EXEC PGM=IDCAMS,COND=(0,NE,LOAD)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  PRINT INDATASET(MBANK.SEQ) CHARACTER
/*
//