//PUTMBK  JOB (TEST),'PUT KICKS CLIST',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//PUTCLIST EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
PROC 0
CONTROL MSG NOFLUSH

ALLOC F(CUSTFILE) DA('MBANK.CUST') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLCUST

ALLOC F(NATPATH) DA('MBANK.CUST.NATPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLNAT

ALLOC F(SEQFILE) DA('MBANK.SEQ') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLSEQ

ALLOC F(ACCTFILE) DA('MBANK.ACCT') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLACCT

ALLOC F(ACCTCUST) DA('MBANK.ACCT.CUSTPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLACCS

ALLOC F(ACCTIBAN) DA('MBANK.ACCT.IBANPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLACCI

ALLOC F(CARDFILE) DA('MBANK.CARD') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLCARD

ALLOC F(CARDACCT) DA('MBANK.CARD.ACCTPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLCARA

ALLOC F(CARDNUM) DA('MBANK.CARD.NUMPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLCARN

ALLOC F(TXNFILE) DA('MBANK.TXN') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLTXNF

ALLOC F(TXNID) DA('MBANK.TXN.TXNPATH') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLTXNI

ALLOC F(DAYRPT) DA('MBANK.DAYRPT') SHR REUSE
IF &LASTCC NE 0 THEN GOTO FLDAYR

EXEC 'HERC01.KICKSSYS.V1R5M0.CLIST(KICKS)' +
  'KIKID(HERC01) TSOID(HERC01) PCT(MB) PPT(MB) FCT(MB) TRCFLAGS(3)'
GOTO CLEANUP

FLCUST: +
WRITE MBKICKS: CUSTFILE ALLOCATION FAILED.
GOTO CLEANUP
FLNAT: +
WRITE MBKICKS: NATPATH ALLOCATION FAILED.
GOTO CLEANUP
FLSEQ: +
WRITE MBKICKS: SEQFILE ALLOCATION FAILED.
GOTO CLEANUP
FLACCT: +
WRITE MBKICKS: ACCTFILE ALLOCATION FAILED.
GOTO CLEANUP
FLACCS: +
WRITE MBKICKS: ACCTCUST ALLOCATION FAILED.
GOTO CLEANUP
FLACCI: +
WRITE MBKICKS: ACCTIBAN ALLOCATION FAILED.
GOTO CLEANUP
FLCARD: +
WRITE MBKICKS: CARDFILE ALLOCATION FAILED.
GOTO CLEANUP
FLCARA: +
WRITE MBKICKS: CARDACCT ALLOCATION FAILED.
GOTO CLEANUP
FLCARN: +
WRITE MBKICKS: CARDNUM ALLOCATION FAILED.
GOTO CLEANUP
FLTXNF: +
WRITE MBKICKS: TXNFILE ALLOCATION FAILED.
GOTO CLEANUP
FLTXNI: +
WRITE MBKICKS: TXNID ALLOCATION FAILED.
GOTO CLEANUP
FLDAYR: +
WRITE MBKICKS: DAYRPT ALLOCATION FAILED.

CLEANUP: +
CONTROL NOMSG NOFLUSH
FREE F(DAYRPT)
FREE F(TXNID)
FREE F(TXNFILE)
FREE F(CARDNUM)
FREE F(CARDACCT)
FREE F(CARDFILE)
FREE F(ACCTIBAN)
FREE F(ACCTCUST)
FREE F(ACCTFILE)
FREE F(SEQFILE)
FREE F(NATPATH)
FREE F(CUSTFILE)
EXIT
/*
//SYSUT2   DD DSN=HERC01.CMDPROC(MBKICKS),DISP=SHR
//SYSIN    DD DUMMY
/*
