//RDDAY07 JOB (TEST),'READ CLOSE 20260907',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//READ     EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC01.MBANK.REPORTS(D260907),DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
