//${REQUEST_ID} JOB (TEST),'READ CLOSE ${BUSINESS_DATE}',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//READ     EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=A
//SYSUT1   DD DSN=HERC01.MBANK.REPORTS(${REPORT_MEMBER}),DISP=SHR
//SYSUT2   DD SYSOUT=Z
//SYSIN    DD DUMMY
