//CARDAIX JOB (TEST),'BUILD CARD AIX',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//DEFACCT  EXEC PGM=IDCAMS
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE ALTERNATEINDEX ( -
         NAME(MBANK.CARD.ACCTIX) -
         RELATE(MBANK.CARD) -
         VOLUMES(TSO001) -
         TRACKS(1 1) -
         KEYS(13 14) -
         RECORDSIZE(31 278) -
         NONUNIQUEKEY -
         UPGRADE -
  ) -
  DATA ( -
       NAME(MBANK.CARD.ACCTIX.D) -
  ) -
  INDEX ( -
        NAME(MBANK.CARD.ACCTIX.I) -
  )
/*
//*
//BLDACCT  EXEC PGM=IDCAMS,COND=(0,NE,DEFACCT)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  BLDINDEX -
       INDATASET(MBANK.CARD) -
       OUTDATASET(MBANK.CARD.ACCTIX)
/*
//*
//PTHACCT  EXEC PGM=IDCAMS,COND=(0,NE,BLDACCT)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE PATH ( -
         NAME(MBANK.CARD.ACCTPATH) -
         PATHENTRY(MBANK.CARD.ACCTIX) -
         UPDATE -
  )
/*
//*
//DEFNUM   EXEC PGM=IDCAMS,COND=(0,NE,PTHACCT)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE ALTERNATEINDEX ( -
         NAME(MBANK.CARD.NUMIX) -
         RELATE(MBANK.CARD) -
         VOLUMES(TSO001) -
         TRACKS(1 1) -
         KEYS(16 40) -
         RECORDSIZE(34 34) -
         UNIQUEKEY -
         UPGRADE -
  ) -
  DATA ( -
       NAME(MBANK.CARD.NUMIX.D) -
  ) -
  INDEX ( -
        NAME(MBANK.CARD.NUMIX.I) -
  )
/*
//*
//BLDNUM   EXEC PGM=IDCAMS,COND=(0,NE,DEFNUM)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  BLDINDEX -
       INDATASET(MBANK.CARD) -
       OUTDATASET(MBANK.CARD.NUMIX)
/*
//*
//PTHNUM   EXEC PGM=IDCAMS,COND=(0,NE,BLDNUM)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE PATH ( -
         NAME(MBANK.CARD.NUMPATH) -
         PATHENTRY(MBANK.CARD.NUMIX) -
         UPDATE -
  )
/*
//*
//CHECK    EXEC PGM=IDCAMS,COND=(0,NE,PTHNUM)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT(MBANK.CARD.ACCTIX) ALL
  LISTCAT ENT(MBANK.CARD.ACCTPATH) ALL
  LISTCAT ENT(MBANK.CARD.NUMIX) ALL
  LISTCAT ENT(MBANK.CARD.NUMPATH) ALL
  PRINT INDATASET(MBANK.CARD.ACCTPATH) DUMP
  PRINT INDATASET(MBANK.CARD.NUMPATH) DUMP
/*
