//TXNAIX  JOB (TEST),'BUILD TXN AIX',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//DEFTXN   EXEC PGM=IDCAMS
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE ALTERNATEINDEX ( -
         NAME(MBANK.TXN.TXNIX) -
         RELATE(MBANK.TXN) -
         VOLUMES(TSO001) -
         TRACKS(2 1) -
         KEYS(13 14) -
         RECORDSIZE(44 122) -
         NONUNIQUEKEY -
         UPGRADE -
  ) -
  DATA ( -
       NAME(MBANK.TXN.TXNIX.D) -
  ) -
  INDEX ( -
        NAME(MBANK.TXN.TXNIX.I) -
  )
/*
//*
//BLDTXN   EXEC PGM=IDCAMS,COND=(0,NE,DEFTXN)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  BLDINDEX -
       INDATASET(MBANK.TXN) -
       OUTDATASET(MBANK.TXN.TXNIX)
/*
//*
//PTHTXN   EXEC PGM=IDCAMS,COND=(0,NE,BLDTXN)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE PATH ( -
         NAME(MBANK.TXN.TXNPATH) -
         PATHENTRY(MBANK.TXN.TXNIX) -
         UPDATE -
  )
/*
//*
//CHECK    EXEC PGM=IDCAMS,COND=(0,NE,PTHTXN)
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT(MBANK.TXN.TXNIX) ALL
  LISTCAT ENT(MBANK.TXN.TXNPATH) ALL
  PRINT INDATASET(MBANK.TXN.TXNPATH) DUMP
/*
