//MBKRAKF JOB (TSO),'ADD RAKF USERS',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//USR1     EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 CALL 'SYS2.CMDLIB(ADDUSER)' +
 'MBKSRV1 PASSWORD(${MB_TSO_PASSWORD_1}) DFLTGRP(USER)'
/*
//*
//USR2     EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 CALL 'SYS2.CMDLIB(ADDUSER)' +
 'MBKSRV2 PASSWORD(${MB_TSO_PASSWORD_2}) DFLTGRP(USER)'
/*
//*
//USR3     EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 CALL 'SYS2.CMDLIB(ADDUSER)' +
 'MBKSRV3 PASSWORD(${MB_TSO_PASSWORD_3}) DFLTGRP(USER)'
/*
