//MBKUSRS JOB (TSO),'ADD TERMINAL USERS',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//USR1     EXEC PGM=IKJEFT01
//SYSUADS  DD DISP=SHR,DSN=SYS1.UADS
//SYSLBC   DD DISP=SHR,DSN=SYS1.BRODCAST
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 ACCOUNT
 ADD (MBKSRV1 MONIBANK * ISPLOGON) +
     NOLIM +
     NOOPER +
     NOACCT +
     JCL +
     NOMOUNT +
     UNIT(TSO) +
     SIZE(8192)
 LIST (MBKSRV1)
 END
/*
//*
//USR2     EXEC PGM=IKJEFT01
//SYSUADS  DD DISP=SHR,DSN=SYS1.UADS
//SYSLBC   DD DISP=SHR,DSN=SYS1.BRODCAST
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 ACCOUNT
 ADD (MBKSRV2 MONIBANK * ISPLOGON) +
     NOLIM +
     NOOPER +
     NOACCT +
     JCL +
     NOMOUNT +
     UNIT(TSO) +
     SIZE(8192)
 LIST (MBKSRV2)
 END
/*
//*
//USR3     EXEC PGM=IKJEFT01
//SYSUADS  DD DISP=SHR,DSN=SYS1.UADS
//SYSLBC   DD DISP=SHR,DSN=SYS1.BRODCAST
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 ACCOUNT
 ADD (MBKSRV3 MONIBANK * ISPLOGON) +
     NOLIM +
     NOOPER +
     NOACCT +
     JCL +
     NOMOUNT +
     UNIT(TSO) +
     SIZE(8192)
 LIST (MBKSRV3)
 END
/*
//
