       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTSEQ.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT SEQUENCE-FILE
               ASSIGN TO SEQFILE
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS SEQUENCE-NAME.

       DATA DIVISION.
       FILE SECTION.

       FD  SEQUENCE-FILE.

       01  SEQUENCE-RECORD.
           05 SEQUENCE-NAME        PIC X(12).
           05 SEQUENCE-VALUE       PIC X(12).
           05 FILLER               PIC X(8).

       PROCEDURE DIVISION.

           STOP RUN.