//DUMPFCT JOB (TEST),'DUMP KICKS FCT',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC01.KICKSSYS.V1R5M0.INSTLIB(KIKFCT1$),
//             DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//