//DUMPKTAB JOB (TEST),'DUMP KICKS TABLES',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//PCT      EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC01.KICKSSYS.V1R5M0.INSTLIB(KIKPCT1$),
//             DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//PPT      EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC01.KICKSSYS.V1R5M0.INSTLIB(KIKPPT1$),
//             DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//