//DUMPGW JOB (TEST),'DUMP GATEWAY COPY',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//PRINT    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=A
//SYSUT1   DD DSN=HERC01.KICKS.V1R5M0.COBCOPY(MBGWMSD),
//             DISP=SHR
//SYSUT2   DD SYSOUT=A
//SYSIN    DD DUMMY
//