//TXNCHK  JOB (TEST),'CHECK TXN VSAM',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//*
//CHECK    EXEC PGM=IDCAMS
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT(MBANK.TXN) ALL
  LISTCAT ENT(MBANK.TXN.TXNIX) ALL
  LISTCAT ENT(MBANK.TXN.TXNPATH) ALL
/*