//TXNREBL JOB (TEST),'REBUILD TXN AIX',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=${JOB_USER},
//             PASSWORD=${JOB_PASSWORD}
//REBUILD  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//STEPCAT  DD DSN=SYS1.UCAT.TSO,DISP=SHR
//SYSIN    DD *
  DELETE MBANK.TXN.TXNPATH PATH PURGE

  IF LASTCC = 8 THEN
     SET MAXCC = 0

  DELETE MBANK.TXN.TXNIX ALTERNATEINDEX PURGE

  IF LASTCC = 8 THEN
     SET MAXCC = 0

  DEFINE ALTERNATEINDEX ( -
         NAME(MBANK.TXN.TXNIX) -
         RELATE(MBANK.TXN) -
         VOLUMES(TSO001) -
         TRACKS(5 2) -
         KEYS(13 14) -
         RECORDSIZE(44 2048) -
         NONUNIQUEKEY -
         UPGRADE ) -
       DATA ( -
         NAME(MBANK.TXN.TXNIX.D) ) -
       INDEX ( -
         NAME(MBANK.TXN.TXNIX.I) )

  BLDINDEX -
       INDATASET(MBANK.TXN) -
       OUTDATASET(MBANK.TXN.TXNIX)

  DEFINE PATH ( -
       NAME(MBANK.TXN.TXNPATH) -
       PATHENTRY(MBANK.TXN.TXNIX) -
       UPDATE )

  LISTCAT ENT(MBANK.TXN.TXNIX) ALL

  LISTCAT ENT(MBANK.TXN.TXNPATH) ALL
/*